ShyyModel/shyyValidation/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];; // [m^2/s^2]

internalField   uniform 0;

boundaryField
{
    exposed        
    {    
		type            zeroGradient;
	}
	solidWall      
    {   
		type            zeroGradient;
    }
	
	wallRhoC      
    {   
		type            zeroGradient;
    }

    /*electrodes_grounded      
    {
		type            fixedValue;
		value           uniform  0;  
    }*/

    front     
    {
		type            empty; 
    }
   
	back 
	{
		type            empty;  	
	}

	top
	{
		type            zeroGradient;
    }
	
	bottom
	{
		type            zeroGradient; 
    }
	
	inlet
	{
		type            zeroGradient; 
    }
	
	outlet
	{
		type            fixedValue;
		value           uniform  0; 
    }

}


// ************************************************************************* //
