ShyyModel/shyyValidation/system/fvSchemes
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default       Gauss linear;
    grad(ElPot)   Gauss linear;
}

divSchemes
{
    default       	Gauss linear;
	div(phi,U)		Gauss limitedLinearV 1;	
}


laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(epsR,ElPot) Gauss linear corrected;
	laplacian(epsR,rhoC) Gauss linear corrected;
}

curlSchemes
{
    default         none;
}

interpolationSchemes
{
    default         linear;
}

// ************************************************************************* //
