ShyyModel/shyyValidation/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            ("libsampling.so");

//writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   csv;

setConfig
{
    type    lineCell;
    axis    distance;  // x, y, z, xyz
	nPoints 30;
}

sets
(
	ST1
    {
        $setConfig;
        start (-0.00875 0.0 0.001 );
		end   (-0.00875 0.0033  0.001);
    }
	
	ST2
    {
        $setConfig;
        start (-0.0015 0.0 0.001 );
		end   (-0.0015 0.0033 0.001);
    }
	
	ST3
	{
        $setConfig;
        start (0.0004 0.0 0.001 );
		end   (0.0004 0.0033 0.001);
    }

    ST4
    {
        $setConfig;
        start (0.0038 0.0 0.001 );
		end   (0.0038 0.0033 0.001);
    }
	
);

fields  (U);

// ************************************************************************* //